Tekla Open API Reference for Tekla Structures 2025
BoltCatalogSize Class
 The BoltCatalogSize class represents a control to select the bolt size using the bolt catalog.
 Bolt catalog controls always need to be in pairs, meaning in every dialog there has to be a BoltCatalogStandard and a BoltCatalogSize control.
 The property BoltCatalogStandard.LinkedBoltCatalogSize sets to which BoltCatalogSize the control is linked.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ListControl
 System.Windows.Forms.ComboBox
 Tekla.Structures.Dialog.UIControls.BoltCatalogSize
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class BoltCatalogSize : ComboBox
Public Class BoltCatalogSize
	Inherits ComboBox
The BoltCatalogSize type exposes the following members.
Constructors
Name | Description
BoltCatalogSize
 Initiates a new instance of the control.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace